app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."slug" = ? LIMIT ?  [["slug", "zaguzy"], ["LIMIT", 1]]
---
  def show
    @article = Article.friendly.find(params[:slug])

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "slug") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    @article.slug = @article.title.parameterize

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."slug" = ? LIMIT ?  [["slug", "zaguzy"], ["LIMIT", 1]]
---
  def edit
    @article = Article.friendly.find(params[:slug])

SELECT "articles".* FROM "articles" WHERE "articles"."slug" = ? LIMIT ?  [["slug", "zaguzy"], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ?, "status" = ?, "slug" = ? WHERE "articles"."id" = ?  [["title", "Zaguzy1"], ["updated_at", "2023-07-13 21:17:07.817645"], ["status", "public"], ["slug", "zaguzy1"], ["id", 3]]
---
  def update
    @article = Article.friendly.find(params[:slug])
    if @article.title != article_params[:title]
      @article.slug = article_params[:title].parameterize
    end

    if @article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."slug" = ? LIMIT ?  [["slug", "zaguzy1"], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
---
  def destroy
    @article = Article.friendly.find(params[:slug])
    @article.comments.destroy_all
    @article.destroy