app/controllers/comments_controller.rb

  def create
    @article = Article.friendly.find(params[:article_slug])
    @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."slug" = ? LIMIT ?  [["slug", "eqwqweqweweqqwewqe"], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "wqeeeeeeee"], ["body", "qweeeeeeeeee"], ["article_id", 11], ["created_at", "2023-07-13 22:10:32.194541"], ["updated_at", "2023-07-13 22:10:32.194541"], ["status", "public"]]

  def destroy
    @article = Article.friendly.find(params[:article_slug])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."slug" = ? LIMIT ?  [["slug", "eqwqweqweweqqwewqe"], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 11], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]